:PROPERTIES:
:ID:       d5dd574d-89a8-41fc-8a51-e793bbea1725
:END:
#+title: python
#+filetags: index

* Footnotes

[fn:1]
#+begin_src python :results output
lst = [1,2,3]
print(id(lst))
lst.append([2])
print(id(lst))
#+end_src

#+RESULTS:
: 139623157909888
: 139623157909888

[fn:2]
列表作为队列效率低：列表尾插入删除快，但列表头插入删除很慢

[fn:3]
x in s => 若x是s的成员，则返回True

[fn:4]
默认匹配，没有匹配的内容就会匹配它

[fn:5]
#+begin_src python
match point:
    case Point(x, y) if x == y:
        print(f"Y=X at {x}")
    case Point(x, y):
        print(f"Not on the diagonal")
#+end_src

[fn:6]
#+begin_src python
case (Point(x1, y1), Point(x2, y2) as p2): ... # 将第二个元素捕获为p2
#+end_src

[fn:7]
因此我们可以创建其他名称指向同一函数对象

[fn:8]
位置参数必须在关键字参数之前

[fn:9]
可以和**kwds组合使用，但是必须在**kwds之前

[fn:10]
脚本中定义了函数func()，则func()在全局命名空间，直接func()调用

[fn:11]
模块mod中定义了函数func()，则func()在模块mod的命名空间，mod.func()调用

[fn:12]
情景1:import mod到全局命名空间，调用mod中的func()函数
mod.func()
情景2:from mod import func到全局命名空间，调用mod中的func()函数
func()

[fn:13]
__all__中有模块名称func，__init__.py中定义了函数func，则从包导入*不会导入func模块，因为函数func的名称覆盖了模块func的名称

[fn:14]
相对导入，基于当前模块名；若当前模块是主模块，则主模块名永远是__main__，那又如何进行相对导入呢？

[fn:15]
str.format() var = 'world'; f'hello {var}'
'hello {var}'.format(var)

[fn:16]
#+begin_src python
class test:
    __name # python将其改写为_test__name；只能通过_test__name来访问它，实现伪私有变量
#+end_src

[fn:17]
值按需生成，而不是一次性全部加载 => 节省内存
